ZennoLab.ArticleForge.ArticleForge afTest = new ZennoLab.ArticleForge.ArticleForge();

//ZennoLab.ArticleForge.ArticleForge.CreateArticle: автоматизированное создание контента заданной тематики (только английский язык)
string strTest = afTest.CreateArticle("London", "", 1, 1, false, "short", false, 0, 0, null, 4, false, false, false, false, "");

return strTest;

//Примечания:
//1. Параметры метода ZennoLab.ArticleForge.ArticleForge:
//	первый - Главное ключевое слово
//	второй - Дополнительные ключевые слова
//	третий - Вариативность предложений (число: 1, 2 или 3)
//	четвёртый - Вариативность параграфов (число: 1, 2 или 3)
//	пятый - Перемешивать параграфы (true или false)
//	шестой - Длина итогового текста. Варианты: "very_short" (около 50 слов), "short" (около 200 слов), "medium" (около 500 слов), или "long"(около 750 слов).
//	седьмой - Добавлять заголовки (true или false)
//	восьмой - Вероятность изображений (значение float от 0,00 до 1,00)
//	девятый - Вероятность видео (значение float от 0,00 до 1,00)
//	десятый - "Автоматические ссылки". Заменять определённые ключевые слова в тексте предопределёнными ссылками. Строка по шаблону:  [keyword1, url1, all_occurrence?, keyword2, url2, all_occurrence?,...]
//	одиннадцатый - Качество получаемого текста. Может быть:  1(Regular), 2(Unique), 3(Very Unique), 4(Readable), or 5(Very Readable).
//	двенадцатый - Использовать обычный синонимизатор или нет (true или false)
//	тринадцатый - Использовать "синонимизатор Тьюринга" (?) или нет (true или false)
//	четырнадцатый - Переписывать предложения (true или false)
//	пятнадцатый - Перестраивать предложения (true или false)
//	шестнадцатый - Строка с дополнительными параметрами.
//2. Скачать документацию по API ArticleForge вы можете по ссылке: https://af.articleforge.com/download_api